Repository: 84000/data-translation-memory
Catalog: toh460a-v3.tmx
Source language: bo
Languages: en

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Three Jewels!

source: གནོད་སྦྱིན་གྱི་སྡེ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དྲག་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the great yakṣa general, the fierce Vajrapāṇi!

source: ཨོཾ་མུ་ཙི་ནི་སྭཱ་ཧཱ། མུ་ཁེ་སེ་སྭཱ་ཧཱ། མོ་ཧཱ་ནི་སྭཱ་ཧཱ། དན་ཏི་སྭཱ་ཧཱ། ཆོ་ག་འདི་ཆུ་ཁྱོར་བ་གང་བཟླས་པ་བྱས་ཏེ།
en: oṁ mucini svāhā | mukhese svāhā | mohani svāhā | dantiri svāhā This rite is as follows: One should incant a handful of water and drink it.

source: འཐུངས་ནས་སེམས་བཞིན་དུ་ཉལ་ན་ལག་ན་རྡོ་རྗེས་རྨི་ལམ་སྟོན་པར་འགྱུར་རོ། །
en: Then, when one falls asleep with intent, Vajrapāṇi will reveal a dream.

source: རྨི་ལམ་མཐོང་བ་ཞེས་བྱ་བའི་གཟུངས་རྫོགས་སོ།། །།
en: The Dhāraṇī “Dream Visions” is complete.
